In [1]:
import pandas as pd
import numpy as np

In [8]:
lst = ['L','W','M']
lst = np.array(lst)

In [9]:
pd.Series(lst,lst2)

a    L
b    W
c    M
dtype: object

In [5]:
lst2 = ['a','b','c']

In [6]:
pd.Series(data = lst,index=lst2)

a    L
b    W
c    M
dtype: object

In [11]:
d = {'a':'L','b':'W','c':'M'}

In [12]:
pd.Series(d)

a    L
b    W
c    M
dtype: object

In [14]:
s1 = pd.Series(crc,index = [1,2,3,4])

In [13]:
crc = ['dhoni','Kohli','Andreson','sachin']

In [15]:
s1

1       dhoni
2       Kohli
3    Andreson
4      sachin
dtype: object

In [17]:
s2 = pd.Series(avg)

In [16]:
avg = ['Ironman','Captian','thor','groot']

In [18]:
s2

0    Ironman
1    Captian
2       thor
3      groot
dtype: object

In [19]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [20]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [21]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [22]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [23]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [27]:
df = pd.DataFrame(randn(5,5),index ='A B C D E'.split(),columns='P Q R S T'.split())

In [24]:
from numpy.random import randn

In [28]:
df

          P         Q         R         S         T
A -1.865412 -0.513506 -0.269689 -0.090792  1.098264
B -1.112633 -1.292787  1.546106 -1.503001  1.224229
C -0.947631 -0.366187  0.400864  0.352062  1.724096
D  0.191326 -0.820172 -1.376223  1.950957  1.939028
E -0.215376  0.582756 -0.309750  0.478572 -0.092017

In [33]:
type(df['P'])

pandas.core.series.Series

In [34]:
type(df[['P','Q']])

pandas.core.frame.DataFrame

In [31]:
df.R

A   -0.269689
B    1.546106
C    0.400864
D   -1.376223
E   -0.309750
Name: R, dtype: float64

In [35]:
df['U'] = df['P'] - df['Q']

In [36]:
df

          P         Q         R         S         T         U
A -1.865412 -0.513506 -0.269689 -0.090792  1.098264 -1.351906
B -1.112633 -1.292787  1.546106 -1.503001  1.224229  0.180154
C -0.947631 -0.366187  0.400864  0.352062  1.724096 -0.581444
D  0.191326 -0.820172 -1.376223  1.950957  1.939028  1.011498
E -0.215376  0.582756 -0.309750  0.478572 -0.092017 -0.798132

In [42]:
df.drop('E',axis=0)

          P         Q         R         S         T
A -1.865412 -0.513506 -0.269689 -0.090792  1.098264
B -1.112633 -1.292787  1.546106 -1.503001  1.224229
C -0.947631 -0.366187  0.400864  0.352062  1.724096
D  0.191326 -0.820172 -1.376223  1.950957  1.939028

In [41]:
df

          P         Q         R         S         T
A -1.865412 -0.513506 -0.269689 -0.090792  1.098264
B -1.112633 -1.292787  1.546106 -1.503001  1.224229
C -0.947631 -0.366187  0.400864  0.352062  1.724096
D  0.191326 -0.820172 -1.376223  1.950957  1.939028
E -0.215376  0.582756 -0.309750  0.478572 -0.092017

In [43]:
df.drop('E',axis=0)

          P         Q         R         S         T
A -1.865412 -0.513506 -0.269689 -0.090792  1.098264
B -1.112633 -1.292787  1.546106 -1.503001  1.224229
C -0.947631 -0.366187  0.400864  0.352062  1.724096
D  0.191326 -0.820172 -1.376223  1.950957  1.939028

In [44]:
df

          P         Q         R         S         T
A -1.865412 -0.513506 -0.269689 -0.090792  1.098264
B -1.112633 -1.292787  1.546106 -1.503001  1.224229
C -0.947631 -0.366187  0.400864  0.352062  1.724096
D  0.191326 -0.820172 -1.376223  1.950957  1.939028
E -0.215376  0.582756 -0.309750  0.478572 -0.092017

In [45]:
df.loc['B']

P   -1.112633
Q   -1.292787
R    1.546106
S   -1.503001
T    1.224229
Name: B, dtype: float64

In [46]:
df.iloc[1]

P   -1.112633
Q   -1.292787
R    1.546106
S   -1.503001
T    1.224229
Name: B, dtype: float64

In [48]:
df.loc[['A','B'],['P','Q']]

          P         Q
A -1.865412 -0.513506
B -1.112633 -1.292787

In [49]:
df > 0

       P      Q      R      S      T
A  False  False  False  False   True
B  False  False   True  False   True
C  False  False   True   True   True
D   True  False  False   True   True
E  False   True  False   True  False

In [50]:
df[df<0]

          P         Q         R         S         T
A -1.865412 -0.513506 -0.269689 -0.090792       NaN
B -1.112633 -1.292787       NaN -1.503001       NaN
C -0.947631 -0.366187       NaN       NaN       NaN
D       NaN -0.820172 -1.376223       NaN       NaN
E -0.215376       NaN -0.309750       NaN -0.092017

In [54]:
df[(df['P']>0) & df['R'] >1]

Empty DataFrame
Columns: [P, Q, R, S, T]
Index: []

In [55]:
df

          P         Q         R         S         T
A -1.865412 -0.513506 -0.269689 -0.090792  1.098264
B -1.112633 -1.292787  1.546106 -1.503001  1.224229
C -0.947631 -0.366187  0.400864  0.352062  1.724096
D  0.191326 -0.820172 -1.376223  1.950957  1.939028
E -0.215376  0.582756 -0.309750  0.478572 -0.092017

In [56]:
df.reset_index()

  index         P         Q         R         S         T
0     A -1.865412 -0.513506 -0.269689 -0.090792  1.098264
1     B -1.112633 -1.292787  1.546106 -1.503001  1.224229
2     C -0.947631 -0.366187  0.400864  0.352062  1.724096
3     D  0.191326 -0.820172 -1.376223  1.950957  1.939028
4     E -0.215376  0.582756 -0.309750  0.478572 -0.092017

In [59]:
df['Index'] = lst

In [60]:
lst ='AA BB CC DD EE'.split()

In [61]:
df

          P         Q         R         S         T Index
A -1.865412 -0.513506 -0.269689 -0.090792  1.098264    AA
B -1.112633 -1.292787  1.546106 -1.503001  1.224229    BB
C -0.947631 -0.366187  0.400864  0.352062  1.724096    CC
D  0.191326 -0.820172 -1.376223  1.950957  1.939028    DD
E -0.215376  0.582756 -0.309750  0.478572 -0.092017    EE

In [62]:
df.set_index('Index')

              P         Q         R         S         T
Index
AA    -1.865412 -0.513506 -0.269689 -0.090792  1.098264
BB    -1.112633 -1.292787  1.546106 -1.503001  1.224229
CC    -0.947631 -0.366187  0.400864  0.352062  1.724096
DD     0.191326 -0.820172 -1.376223  1.950957  1.939028
EE    -0.215376  0.582756 -0.309750  0.478572 -0.092017

In [63]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [64]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [65]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.200530 -0.189801
   2  1.089603 -0.404647
   3  1.386033  1.026137
G2 1  0.109426  0.265323
   2  2.234035 -1.305039
   3 -0.536498 -1.104307

In [67]:
df.loc['G1'].loc[1]

A    0.200530
B   -0.189801
Name: 1, dtype: float64

In [68]:
df.index.names

FrozenList([None, None])

In [70]:
df.index.names = ['Group','Num']

In [71]:
df

                  A         B
Group Num
G1    1    0.200530 -0.189801
      2    1.089603 -0.404647
      3    1.386033  1.026137
G2    1    0.109426  0.265323
      2    2.234035 -1.305039
      3   -0.536498 -1.104307

In [72]:
df.xs(['G1',1])

A    0.200530
B   -0.189801
Name: (G1, 1), dtype: float64

In [73]:
df.xs(1,level='Num')

              A         B
Group
G1     0.200530 -0.189801
G2     0.109426  0.265323

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh = 1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.fillna(value = '***')

     A    B  C
0    1    5  1
1    2  ***  2
2  ***  ***  3

In [9]:
df['B'].fillna(value = df['C'].mean())

0    5.0
1    2.0
2    2.0
Name: B, dtype: float64

In [10]:
df['C'].mean()

2.0

In [11]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [18]:
 df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [17]:
a.mean(

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [19]:
 df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [20]:
 df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [22]:
 df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [24]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [25]:
import pandas as pd

In [27]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [28]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
           
                    'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [29]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [30]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [31]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [32]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [33]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [34]:
pd.concat([df1,df2,df3],axis =1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [35]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [36]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [37]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [38]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [39]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [40]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [41]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [42]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [43]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [46]:
df['col2'].nunique()

3

In [47]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [53]:
df[df['col1'] == 2]

   col1  col2 col3
1     2   555  def

In [54]:
def sq(x):
    return x **2

In [56]:
df['col1'].sum()

10

In [57]:
del df['col1']

In [58]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [59]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [60]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [61]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [62]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [63]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [64]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [65]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [66]:
df.fillna('@')

  col1 col2 col3
0    1    @  abc
1    2  555  def
2    3  666  ghi
3    @  444  xyz

In [67]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [73]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [74]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [75]:
import pandas as pd

In [76]:
import numpy as np

In [93]:
df = pd.read_csv('example')

In [92]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 9ED8-90F3

 Directory of C:\Users\LENOVO\Desktop\LWM python\Learn with me DataScience\03-Python-for-Data-Analysis-Pandas

08/28/2020  05:41 PM    <DIR>          .
08/28/2020  05:41 PM    <DIR>          ..
08/26/2020  10:55 PM    <DIR>          .ipynb_checkpoints
08/26/2020  07:32 PM             1,133 01-Introduction to Pandas.ipynb
08/26/2020  07:32 PM             8,249 02-Series.ipynb
08/26/2020  07:40 PM            57,319 03-DataFrames.ipynb
08/26/2020  10:53 PM             7,335 04-Missing Data.ipynb
08/26/2020  10:55 PM            21,382 05-Groupby.ipynb
06/29/2020  11:34 AM            39,148 06-Merging, Joining, and Concatenating.ipynb
08/26/2020  10:53 PM            22,522 07-Operations.ipynb
08/26/2020  11:28 PM            77,530 08-Data Input and Output.ipynb
08/28/2020  05:32 PM                51 example
08/31/2018  12:24 AM             5,508 Excel_Sample.xlsx
08/31/2018  12:24 AM               560 multi_index_example
08/28/2020  05:41 PM           130,508 Practice.ipynb
              12 File(s)        371,245 bytes
               3 Dir(s)  325,410,119,680 bytes free

In [94]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [96]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [97]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

URLError: <urlopen error [Errno 11001] getaddrinfo failed>